app/Controllers/Admin.php

    public function index(){
        $data['title'] =  'User List';

        // Mengambil semua data pengguna
        $userModel = new \App\Models\User();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`